Boolean(42);
Number('42');
String(42);

if ('false') {} // -> if (true) { }
if (Boolean('false')) {} // то же самое

if ('' && 0 || 32.3) {} // (true && false || true) {}
if (Boolean('' && 0 || 32.3)) {}


'2' - '2'; // 0
Number('2') - Number('2'); // 0

'4' / 'два'; // NaN, так как Number('два') вернет NaN

+'42'; // 42
-'42'; // -42
-'сорок два'; // Nan

true / false; // 1 / 0, Infinity
false * true; // 0 * 1, 0
'100500' ** false; // 1, 100500 в степени 0

'4' + 2; // строка 42, так как это конкатенация
4 + '2'; // 42, тот же результат

42 + 10 + '15' + true;
// 1) 42 + 10 = 52
// 2) 52 + '15' = '5215'
// 3) '5215' + true = '5215true'

'1' == 1; // true, оба операнда приводятся к числу 1 == 1
true == 1; // true оба операнда также приводятся к 1
({}) == 0; // false, NaN == 0, так как пустой объект нельзя привести к числу
({ toString() {return '3'; } }) == 3; //true

'1' > 2; // false, 1 > 2
true < 5; // true 1 < 5
({}) <= 0;
({ toString() { return '1'; } }) >= false; //true, 1 > 0
